RomanBeneder/OpenLab/SourceCodes/uC/XMC4500/Scope/OpenLab_uC_dev/OpenLab/libs/XMCLib/inc/xmc_usic.h
/**
 * @brief API to get receive buffer status
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return Status of data validity check for RBUF0 and RBUF1. \n
 * 		   Returned value should be masked with RDV0 and RDV1 bits to know the status. \n
 * 		   \b Range: @ref XMC_USIC_CH_RBUF_STATUS_DATA_VALID0, @ref XMC_USIC_CH_RBUF_STATUS_DATA_VALID1.
 *
 * \par<b>Description</b><br>
 * Checks if RBUF0 and RBUF1 have valid unread data. \n\n
 * It checks the bits RDV0 and RDV1 of the RBUFSR register.
 * Returns the value of RBUFSR masked with bitmasks of RDV0 and RDV1.
 * It can be used to decide whether 2bytes has to be read from RBUF or 1 byte. 
 * If both bitmasks XMC_USIC_CH_RBUF_STATUS_DATA_VALID0 and XMC_USIC_CH_RBUF_STATUS_DATA_VALID1
 * are set, then 2 bytes can be read from RBUF. If only either of them is set, then only one byte
 * can be read from RBUF.
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_GetTransmitBufferStatus() \n\n\n
 */
__STATIC_INLINE uint32_t XMC_USIC_CH_GetReceiveBufferStatus(XMC_USIC_CH_t *const channel)
{
  return ((uint32_t) (channel->RBUFSR & (USIC_CH_RBUFSR_RDV0_Msk | USIC_CH_RBUFSR_RDV1_Msk)));
}


/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  start_transmision_mode Transmission mode to be enabled. \n
 * 								\b Range: @ref XMC_USIC_CH_START_TRANSMISION_DISABLED,
 * 								@ref XMC_USIC_CH_START_TRANSMISION_ON_TDV, @ref XMC_USIC_CH_START_TRANSMISION_ON_TDV_DX2S_0,
 * 								@ref XMC_USIC_CH_START_TRANSMISION_ON_TDV_DX2S_1
 *                              
 * @return None
 *
 * \par<b>Description</b><br>
 * Configures data transmission. \n\n
 * The configuration affects the data shifted on the DOUT0 pin.
 * 
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_GetTransmitBufferStatus(), XMC_USIC_CH_SetDataOutputMode() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_SetStartTransmisionMode(XMC_USIC_CH_t *const channel,
                                                         const XMC_USIC_CH_START_TRANSMISION_MODE_t start_transmision_mode)
{
  channel->TCSR = (uint32_t)(channel->TCSR & (~USIC_CH_TCSR_TDEN_Msk)) | (uint32_t)start_transmision_mode;
}


/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  data_output_mode  Data output mode. \n
 * 			\b Range: @ref XMC_USIC_CH_DATA_OUTPUT_MODE_NORMAL, @ref XMC_USIC_CH_DATA_OUTPUT_MODE_INVERTED
 * @return None
 *
 * \par<b>Description</b><br>
 * Configures the mode for data output. \n\n
 * USIC channel can be configured to shift inverted data or direct data based on the input to the API.
 * 
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetStartTransmisionMode() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_SetDataOutputMode(XMC_USIC_CH_t *const channel,
                                                   const XMC_USIC_CH_DATA_OUTPUT_MODE_t data_output_mode)
{
  channel->SCTR = (uint32_t)(channel->SCTR & (~USIC_CH_SCTR_DOCFG_Msk)) | (uint32_t)data_output_mode;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return None
 *
 * \par<b>Description</b><br>
 * Enables automatic update of frame length. \n\n
 * When the automatic update of frame length is enabled, frame length is configured based on the 
 * index of the TBUF[]/IN[] register array. When the data is written to TBUF[x], frame length is configured
 * with the mask value of \a x at the last 5 bit positions. Same logic is applicable if data is written to
 * IN[x] register.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_DisableFrameLengthControl(), XMC_USIC_CH_TXFIFO_PutDataFLEMode() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_EnableFrameLengthControl(XMC_USIC_CH_t *const channel)
{
  channel->TCSR = (uint32_t)(channel->TCSR & (~(USIC_CH_TCSR_WLEMD_Msk |
                                         USIC_CH_TCSR_SELMD_Msk |
                                         USIC_CH_TCSR_WAMD_Msk |
                                         USIC_CH_TCSR_HPCMD_Msk))) |
                                         (uint32_t)USIC_CH_TCSR_FLEMD_Msk;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return None
 *
 * \par<b>Description</b><br>
 * Disables automatic update of frame length. \n\n
 * When automatic update of frame length is disabled, frame length has to configured explicitly.
 * Frame length remains fixed until it is changed again.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_DisableFrameLengthControl(), XMC_USIC_CH_SetFrameLength() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_DisableFrameLengthControl(XMC_USIC_CH_t *const channel)
{
  channel->TCSR &= (uint32_t)~USIC_CH_TCSR_FLEMD_Msk;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  service_request_line service request number of the event to be triggered. \n
 * 			\b Range: 0 to 5.
 * @return None
 *
 * \par<b>Description</b><br>
 * Trigger a USIC interrupt service request.\n\n
 * When the USIC service request is triggered, the NVIC interrupt associated with it will be 
 * generated if enabled. 
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetInterruptNodePointer() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_TriggerServiceRequest(XMC_USIC_CH_t *const channel, const uint32_t service_request_line)
{
  channel->FMR |= (uint32_t)(USIC_CH_FMR_SIO0_Msk << service_request_line);
}


/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  transmit_buffer_status clearing or setting the TDV flag. \n
 *
 * @return None
 *
 * \par<b>Description</b><br>
 * Modify TCSR.TDV and TCSR.TE to control the start of a data word transmission by software.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_GetTransmitBufferStatus() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_SetTransmitBufferStatus(XMC_USIC_CH_t *const channel,
		                                                 const XMC_USIC_CH_TBUF_STATUS_SET_t transmit_buffer_status)
{
  channel->FMR |= (uint32_t)transmit_buffer_status;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  passive_level Value of passive level for the channel. \n
 * 			\b Range: @ref XMC_USIC_CH_PASSIVE_DATA_LEVEL0, @ref XMC_USIC_CH_PASSIVE_DATA_LEVEL1
 * @return None
 *
 * \par<b>Description</b><br>
 * Set the passive data level of the output signal. \n\n
 * When the USIC channel transmit stage is idle, the output signal level stays at the 
 * configured passive level.
 * 
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_GetTransmitBufferStatus(), XMC_USIC_CH_SetStartTransmisionMode() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_SetPassiveDataLevel(XMC_USIC_CH_t *const channel,
                                                     const XMC_USIC_CH_PASSIVE_DATA_LEVEL_t passive_level)
{
  channel->SCTR &= (~USIC_CH_SCTR_PDL_Msk);
  channel->SCTR |= (uint32_t)passive_level;
}

